Autodesk.Revit.DB.FaceToposolid.SetFaceReferences(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Sets the referenced faces of the face toposolid
faceReferences:
The references from the massing face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.FaceToposolid.GetReferencedFaces
Gets the referenced faces of the face toposolid
Returns:
The referenced faces
Since:
2025

Autodesk.Revit.DB.FaceToposolid.UpdateToFace
Resets the face toposolid to its defining faces.
Since:
2025

Autodesk.Revit.DB.FaceToposolid.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Creates a new instance of a face toposolid attached to a non-vertical massing face.
document:
The document.
toposolidTypeId:
The toposolid type.
levelId:
The level id.
faceReferences:
The references from the massing face.
Returns:
The newly created face toposolid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
Toposolid type is not valid for this face toposolid.
-or-
The ElementId levelId is not a Level.
-or-
The faces are not valid for face toposolid creation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2025

Autodesk.Revit.DB.FaceToposolid
An object that represents a face-based Toposolid within the Autodesk Revit project.
Since:
2025